<?php

return [

	/*
    |--------------------------------------------------------------------------
    | Api Language Lines
    |--------------------------------------------------------------------------
    |
    | This file is used for messages sent by this api.
    |
    */

	'auth' => [
		'user_not_found' => 'Пользователь не был найден!',
		'not_user_model' => 'Элемент не является моделью пользователя!',
		'registered' => 'Пользователь зарегестрирован!',
		'wrong' => 'Неправильный email или пароль',
		'logged_out' => 'Вы вышли из системы!',
	],

	'base' => [
		'forbidden' => 'Запрещенно!',
		'not_found' => 'Не найдено!',
		'validate' => 'Не пройдена проверка!',
		'sent' => 'Информация была отправлена!',
	],

	'body' => [
		'not_body_model' => 'Элемент не является моделью кузова!',
		'created' => 'Кузов был создан!',
		'updated' => 'Кузов был обновлен!',
		'deleted' => 'Кузов был удален!',
	],

	'brand' => [
		'not_brand_model' => 'Элемент не является моделью бренда!',
		'created' => 'Бренд был создан!',
		'updated' => 'Бренд был обновлен!',
		'deleted' => 'Бренд был удален!',
	],

	'color' => [
		'not_color_model' => 'Элемент не является моделью цвета!',
		'created' => 'Цвет был создан!',
		'updated' => 'Цвет был обновлен!',
		'deleted' => 'Цвет был удален!',
	],

	'country' => [
		'not_country_model' => 'Элемент не является моделью страны!',
		'created' => 'Страна была создана!',
		'updated' => 'Страна была обновлена!',
		'deleted' => 'Страна была удалена!',
	],

	'engine' => [
		'not_engine_model' => 'Элемент не является моделью двигателя',
		'created' => 'Двигатель был создан!',
		'updated' => 'Двигатель был обновлен!',
		'deleted' => 'Двигатель был удален!',
	],

	'gear_box' => [
		'not_gear_box_model' => 'Элемент не является моделью коробки передач!',
		'created' => 'Коробка передач была создана!',
		'updated' => 'Коробка передач была обновлена!',
		'deleted' => 'Коробка передач была удалена!',
	],

	'image' => [
		'not_found' => 'Изоображение не было найдено!',
		'not_image_model' => 'Элемент не является модель изоображения!',
		'used' => "Изоображение под номером :id уже используется",
		'saved' => 'Изоображение было сохранено!',
		'loaded' => 'Изоображение было загружено!',
		'deleted' => 'Изоображение было удалено!',
		'deleted_plural' => 'Изоображения были удалены!',
	],

	'options' => [
		'not_found' => 'Опции не были найдены!',
		'not_option_model' => 'Элемент не является моделью опции!',
	],

	'car' => [
		'not_found' => 'Машина не была найдена!',
		'not_car_model' => 'Элемент не является моделью машины',
		'success' => 'Успех! Машина будет добавлена после прохождения модерации!',
		'updated' => 'Машина была обновлена!',
		'deleted' => 'Машина была удалена!',
	],

	'smth_wrong' => 'Что-то пошло не так!',
];
